// Задача4
/* Напишите программу, которая на вход
 принимает натуральное число N, 
 а на выходе показывает его цифры через запятую.*/

Console.Clear();
Console.Write("Введите любое натуральное число: ");
int number = int.Parse(Console.ReadLine()!);

//Не понял как решить!!!
