// Задача4
/* Напишите программу, которая на вход
 принимает натуральное число N, 
 а на выходе показывает его цифры через запятую.*/

Console.Clear();
Console.Write("Введите любое натуральное число: ");
int number = int.Parse(Console.ReadLine()!);
number = Math.Abs(number);
int i = 0;
for (int i = 0; i < length; i++)
{
    
}